{
  "about": {
    "header": "ABOUT",
    "p1": "Hello! My name is Sebastian, and I am a biologist (MSc) transitioning into the field of web development. My professional background is in diagnostics development, where I developed a strong analytical skill set and attention to detail. Recently, I've decided to pivot my career toward web development.",
    "p2": "To achieve this, I embarked on a self-taught journey through The Odin Project, an open-source curriculum for full-stack development. This program has provided me with a solid understanding of web technologies such as React, Express, MongoDB, and Node.js.",
    "p3": "I am currently in the process of building a full-stack project (rpg-adventure-journal) that demonstrates my ability to create dynamic web applications. This project will be an essential part of my portfolio and reflects my technical capabilities.",
    "p4": "In addition, I have also explored game development prior to web development. I taught myself C# programming for Unity and developed a game prototype, implementing a substantial amount of object-oriented code. This experience has broadened my technical skills and allowed me to apply my programming knowledge creatively.",
    "p5": "I am now looking to apply my diverse background and technical skills in web development. I am keen to contribute to interesting projects and continue learning in this dynamic field.",
    "p6": "Thank you for taking the time to learn about me. I look forward to potential opportunities in web development.",
    "signage": "Best regards,"
  },

  "menu": {
    "work": "WORK",
    "about": "ABOUT"
  },

  "work": {
    "job": "Web-Developer",
    "portfolio": {
      "title": "This portfolio",
      "description": "I've written this portfolio website using Vite + React + Typescript. Language translations are helped by the i18next library and animations are done with the help of the framer-motion library.",
      "linkText": "Already here"
    },
    "majinko": {
      "title": "Majinko",
      "description": "A larger prototype of a Pajinko-like deckbuilder made in Unity using C#. All code was written by me. While working on this passion project, I was able to learn a lot about object-oriented programming. Hosted on itch.io. Besides this larger project, I participated in 12 Game Jams to date, the results of which can be found on my itch.io profile.",
      "linkText": "Game on itch.io"
    },
    "pokegame": {
      "title": "Poké Memory",
      "description": "A small browser game made during the course of the ODIN project. The aim of the game project was to learn about the usage of (REST) APIs. Made with React/Javascript. Hosted through vercel.",
      "linkText": "Live game"
    },
    "calc": {
      "title": "ODIN Calculator",
      "description": "A very simplistic calculator made with basic Javascript, HTML and CSS during the course of the ODIN project basic curriculum. Hosted through GitHub Pages. I have learned a lot since writing this early project.",
      "linkText": "Live calculator"
    }
  }
}
